

# Напишите функцию для анализа выгодности категорий повышенного кэшбека.
def cashback_categories():
    """На вход функции поступают данные для анализа, год и месяц.
    Входные параметры:
    data — данные с транзакциями;
    year — год, за который проводится анализ;
    month — месяц, за который проводится анализ.
    На выходе — JSON с анализом, сколько на каждой категории можно заработать кэшбека в указанном месяце года.

    Выходные параметры
    JSON с анализом, сколько на каждой категории можно заработать кэшбека.
    Формат выходных данных:
    {"Категория 1": 1000, "Категория 2": 2000, "Категория 3": 500}"""
    pass
